; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	image4 - mode
	thermograph3 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star8 - direction
	Star7 - direction
	Star6 - direction
	GroundStation9 - direction
	Star5 - direction
	Star4 - direction
	GroundStation1 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 image1)
	(calibration_target instrument0 Star7)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation9)
	(supports instrument2 image4)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation9)
	(supports instrument3 image1)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star8)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star5)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation9)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(supports instrument6 image4)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 Star4)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite1 Planet11)
	(have_image Star10 thermograph2)
	(have_image Planet11 thermograph2)
	(have_image Planet12 thermograph2)
	(have_image Phenomenon13 thermograph3)
))

)

; plan
1. (turn_to satellite0 star6 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 star6)
   goals met: 1 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 5
3. (calibrate satellite0 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 1 of 5
4. (turn_to satellite0 planet12 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet12)
   goals met: 1 of 5
5. (take_image satellite0 planet12 instrument1 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 2 of 5
6. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 2 of 5
7. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 2 of 5
8. (calibrate satellite3 instrument6 star4)
   added: (calibrated instrument6)
   goals met: 2 of 5
9. (take_image satellite0 planet11 instrument1 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 3 of 5
10. (turn_to satellite0 star10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star10)
   goals met: 3 of 5
11. (take_image satellite0 star10 instrument1 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 4 of 5
12. (turn_to satellite3 phenomenon13 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 phenomenon13)
   goals met: 4 of 5
13. (take_image satellite3 phenomenon13 instrument6 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 5 of 5
